{"format": "layers-model", "generatedBy": "keras v2.10.0", "convertedBy": "TensorFlow.js Converter v4.0.0", "modelTopology": {"keras_version": "2.10.0", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_3", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_4"}, "name": "input_4", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "cv2_wl_1", "trainable": true, "dtype": "float32", "filters": 60, "kernel_size": [65, 65], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "cv2_wl_1", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "cv2_wl_2", "trainable": true, "dtype": "float32", "filters": 30, "kernel_size": [33, 33], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "cv2_wl_2", "inbound_nodes": [[["cv2_wl_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "cv2_wl_3", "trainable": true, "dtype": "float32", "filters": 15, "kernel_size": [17, 17], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "cv2_wl_3", "inbound_nodes": [[["cv2_wl_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "cv2_wl_4", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [9, 9], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "cv2_wl_4", "inbound_nodes": [[["cv2_wl_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "cv2_wl_comp", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "cv2_wl_comp", "inbound_nodes": [[["cv2_wl_4", 0, 0, {}]]]}], "input_layers": [["input_4", 0, 0]], "output_layers": [["cv2_wl_comp", 0, 0]]}}, "training_config": {"loss": {"class_name": "MeanSquaredError", "config": {"reduction": "auto", "name": "mean_squared_error"}}, "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "binary_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 9.999999747378752e-05, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "cv2_wl_1/kernel", "shape": [65, 65, 3, 60], "dtype": "float32"}, {"name": "cv2_wl_1/bias", "shape": [60], "dtype": "float32"}, {"name": "cv2_wl_2/kernel", "shape": [33, 33, 60, 30], "dtype": "float32"}, {"name": "cv2_wl_2/bias", "shape": [30], "dtype": "float32"}, {"name": "cv2_wl_3/kernel", "shape": [17, 17, 30, 15], "dtype": "float32"}, {"name": "cv2_wl_3/bias", "shape": [15], "dtype": "float32"}, {"name": "cv2_wl_4/kernel", "shape": [9, 9, 15, 7], "dtype": "float32"}, {"name": "cv2_wl_4/bias", "shape": [7], "dtype": "float32"}, {"name": "cv2_wl_comp/kernel", "shape": [1, 1, 7, 1], "dtype": "float32"}, {"name": "cv2_wl_comp/bias", "shape": [1], "dtype": "float32"}]}]}