{"format": "layers-model", "generatedBy": "keras v2.10.0", "convertedBy": "TensorFlow.js Converter v4.0.0", "modelTopology": {"keras_version": "2.10.0", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_73", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_74"}, "name": "input_74", "inbound_nodes": []}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_73", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_73", "inbound_nodes": [[["input_74", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "cv2_B_1", "trainable": true, "dtype": "float32", "filters": 10, "kernel_size": [9, 9], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "cv2_B_1", "inbound_nodes": [[["average_pooling2d_73", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "cv2_A_1", "trainable": true, "dtype": "float32", "filters": 10, "kernel_size": [9, 9], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "cv2_A_1", "inbound_nodes": [[["input_74", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "cv2_B_2", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "cv2_B_2", "inbound_nodes": [[["cv2_B_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "cv2_A_2", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "cv2_A_2", "inbound_nodes": [[["cv2_A_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "cv2_B_3", "trainable": true, "dtype": "float32", "filters": 30, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "cv2_B_3", "inbound_nodes": [[["cv2_B_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "cv2_A_3", "trainable": true, "dtype": "float32", "filters": 30, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "cv2_A_3", "inbound_nodes": [[["cv2_A_2", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_73", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_73", "inbound_nodes": [[["cv2_B_3", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_73", "trainable": true, "dtype": "float32", "cropping": [[7, 7], [7, 7]], "data_format": "channels_last"}, "name": "cropping2d_73", "inbound_nodes": [[["cv2_A_3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_73", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_73", "inbound_nodes": [[["up_sampling2d_73", 0, 0, {}], ["cropping2d_73", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "cv2_comp", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "cv2_comp", "inbound_nodes": [[["concatenate_73", 0, 0, {}]]]}], "input_layers": [["input_74", 0, 0]], "output_layers": [["cv2_comp", 0, 0]]}}, "training_config": {"loss": {"class_name": "MeanSquaredError", "config": {"reduction": "auto", "name": "mean_squared_error"}}, "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "binary_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0001, "decay": 0.0, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "cv2_A_1/kernel", "shape": [9, 9, 3, 10], "dtype": "float32"}, {"name": "cv2_A_1/bias", "shape": [10], "dtype": "float32"}, {"name": "cv2_A_2/kernel", "shape": [5, 5, 10, 20], "dtype": "float32"}, {"name": "cv2_A_2/bias", "shape": [20], "dtype": "float32"}, {"name": "cv2_A_3/kernel", "shape": [3, 3, 20, 30], "dtype": "float32"}, {"name": "cv2_A_3/bias", "shape": [30], "dtype": "float32"}, {"name": "cv2_B_1/kernel", "shape": [9, 9, 3, 10], "dtype": "float32"}, {"name": "cv2_B_1/bias", "shape": [10], "dtype": "float32"}, {"name": "cv2_B_2/kernel", "shape": [5, 5, 10, 20], "dtype": "float32"}, {"name": "cv2_B_2/bias", "shape": [20], "dtype": "float32"}, {"name": "cv2_B_3/kernel", "shape": [3, 3, 20, 30], "dtype": "float32"}, {"name": "cv2_B_3/bias", "shape": [30], "dtype": "float32"}, {"name": "cv2_comp/kernel", "shape": [1, 1, 60, 1], "dtype": "float32"}, {"name": "cv2_comp/bias", "shape": [1], "dtype": "float32"}]}]}